### Production environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/NoPlan/NoPlan/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/NoPlan/NoPlan

To view this run in a browser, visit:
https://app.terraform.io/app/ThorstenSauter/NoPlan-production/runs/run-5hHJwEgRiyCNobWj

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.tfe_outputs.global: Refreshing...
data.tfe_outputs.global: Refresh complete after 1s [id=ThorstenSauter-NoPlan-global]
data.azurerm_client_config.current: Refreshing...
module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001]
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zYTk1YzRhOC02NmM1LTRmMGUtYjQ1MC1lOWVmM2E1NGU3MWI7b2JqZWN0SWQ9N2ZiNDg1YjYtMTY2NC00ZTg3LWI1NGQtOThkNTA4OTJmMjVjO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
module.identity.azurerm_user_assigned_identity.uami: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-noplan-prod-001]
module.containerapp_environment.azurerm_log_analytics_workspace.workspace: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.OperationalInsights/workspaces/log-noplan-prod-001]
module.database.azurerm_mssql_server.database_server: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.Sql/servers/sqlsrv-noplan-prod-001]
module.database.azurerm_mssql_firewall_rule.firewall_rule_allow_azure_services: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.Sql/servers/sqlsrv-noplan-prod-001/firewallRules/FirewallRule1]
module.database.azurerm_mssql_database.database: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.Sql/servers/sqlsrv-noplan-prod-001/databases/NoPlan]
module.containerapp_environment.azurerm_container_app_environment.container_environment: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.App/managedEnvironments/acae-noplan-prod-001]
module.monitoring.azurerm_application_insights.appinsights: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.Insights/components/appi-noplan-prod-001]
module.container_app.azurerm_container_app.container_app: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-noplan-api-prod-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.container_app.azurerm_container_app.container_app will be updated in-place
  ~ resource "azurerm_container_app" "container_app" {
        id                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-noplan-api-prod-001"
        name                          = "aca-noplan-api-prod-001"
        tags                          = {
            "environment" = "Production"
            "managed-by"  = "Terraform"
            "project"     = "NoPlan"
        }
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "acrnoplanglobalwesteurope001.azurecr.io/noplan-api:2.10.0" -> "acrnoplanglobalwesteurope001.azurecr.io/noplan-api:63a822382830e8d6acbd36666e55729d37207c75"
                name              = "noplan-api"
                # (5 unchanged attributes hidden)

              ~ env {
                  ~ name        = "ConnectionStrings__Default" -> "AZURE_CLIENT_ID"
                  - secret_name = "connectionstrings-default" -> null
                  + value       = "f89bb89d-de3a-4ca8-b46f-1f15b10382d6"
                }
              + env {
                  + name        = "ConnectionStrings__Default"
                  + secret_name = "connectionstrings-default"
                }

                # (8 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.monitoring.azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.Insights/components/appi-noplan-prod-001"
      ~ local_authentication_disabled         = false -> true
        name                                  = "appi-noplan-prod-001"
        tags                                  = {
            "environment" = "Production"
            "managed-by"  = "Terraform"
            "project"     = "NoPlan"
        }
        # (15 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_role_assignment.monitoring_metrics_publisher_role will be created
  + resource "azurerm_role_assignment" "monitoring_metrics_publisher_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3ff26ad6-f746-4026-b798-87193992f13e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-prod-westeurope-001/providers/Microsoft.Insights/components/appi-noplan-prod-001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0

```

</details>